<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="" xml:lang="">
<head>
  <meta charset="utf-8" />
  <meta name="generator" content="pandoc" />
  <meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes" />
  <meta name="author" content="Xavier Andr&#xE9; &amp; Romain Tavenard" />
  <title>TD6 : Les fichiers</title>
  <style>
    code{white-space: pre-wrap;}
    span.smallcaps{font-variant: small-caps;}
    span.underline{text-decoration: underline;}
    div.column{display: inline-block; vertical-align: top; width: 50%;}
    div.hanging-indent{margin-left: 1.5em; text-indent: -1.5em;}
    ul.task-list{list-style: none;}
  </style>
  <link rel="stylesheet" href="assets/td.css" />
  <!--[if lt IE 9]>
    <script src="//cdnjs.cloudflare.com/ajax/libs/html5shiv/3.7.3/html5shiv-printshiv.min.js"></script>
  <![endif]-->
</head>
<body>
<header id="title-block-header">
<h1 class="title">TD6 : Les fichiers</h1>
<p class="author">Xavier Andr&#xE9; &amp; Romain Tavenard</p>
</header>
<p>Ce sujet traite des fichiers JavaScript Object Notation (JSON). Ce format permet de stocker des donn&#xE9;es structur&#xE9;es, par exemple avec une organisation hi&#xE9;rarchique. Dans ce TD, on se tourne vers un jeu de donn&#xE9;es recensant des notes attribu&#xE9;es &#xE0; des restaurants de la ville de New York.</p>
<h1 data-number="1" id="chargement-des-donn&#xE9;es"><span class="header-section-number">1</span> Chargement des donn&#xE9;es</h1>
<ol type="1">
<li>Sur CURSUS, t&#xE9;l&#xE9;charger le jeu de donn&#xE9;es <code>NYfood.json</code> et l&#x2019;enregistrer dans un dossier <code>data</code> de votre dossier de travail dans VS Code.</li>
<li>Visualiser avec Visual Studio Code le contenu du fichier JSON.</li>
<li>Quels sont les attributs (cl&#xE9;s de dictionnaires) de ce jeu de donn&#xE9;es ? Que contient l&#x2019;attribut <code>grades</code> (qui signifie <code>notes</code> en fran&#xE7;ais) ?</li>
</ol>
<h1 data-number="2" id="extraction-dinformations-&#xE9;l&#xE9;mentaires"><span class="header-section-number">2</span> Extraction d&#x2019;informations &#xE9;l&#xE9;mentaires</h1>
<p>Dans la suite de ce sujet, on nomme &#x201C;restaurant&#x201D; chaque dictionnaire issu du fichier JSON. Les questions suivantes n&#xE9;cessitent de manipuler les donn&#xE9;es depuis Python et le code produit devra &#xEA;tre inclus dans un nouveau fichier <code>td6.py</code>.</p>
<ol type="1">
<li><p>Charger le contenu du fichier <code>NYfood.json</code> dans une liste de dictionnaires, chaque dictionnaire repr&#xE9;sentant un restaurant.</p></li>
<li><p>Combien y a-t-il de restaurants dans ce fichier ?</p></li>
<li><p>Combien y a-t-il de restaurants situ&#xE9;s &#xE0; Manhattan list&#xE9;s dans ce fichier ?</p></li>
<li><p>&#xC9;crire une fonction qui prend en entr&#xE9;e la liste des restaurants et retourne une liste sans doublon des quartiers dans lesquels se situent les restaurants list&#xE9;s dans ce fichier.</p></li>
<li><p>&#xC9;crire une fonction qui prend en entr&#xE9;e la liste des restaurants et affiche, pour chaque restaurant du quartier &#x201C;Manhattan&#x201D;, un r&#xE9;capitulatif de la forme</p>
<p><code>"nom_du_restaurant: adresse"</code></p>
<p>o&#xF9; l&#x2019;adresse est compos&#xE9;e de</p>
<p><code>"building, street, zipcode New York, USA"</code></p></li>
<li><p>Quel est le nombre total de notes attribu&#xE9;es aux restaurants du fichier ?</p></li>
<li><p>Quelles sont les valeurs possibles de notes attribu&#xE9;es aux restaurants par les &#xE9;valuateurs ?</p></li>
</ol>
<h1 data-number="3" id="export-au-format-csv"><span class="header-section-number">3</span> Export au format CSV</h1>
<p>Dans cette partie, il va s&#x2019;agir d&#x2019;enregistrer un export du contenu du fichier <code>NYfood.json</code> au format CSV, en s&#x2019;assurant donc que l&#x2019;on n&#x2019;ait plus d&#x2019;attributs imbriqu&#xE9;s.</p>
<ol type="1">
<li>&#xC9;crire une fonction qui prend en entr&#xE9;e le jeu de donn&#xE9;es pr&#xE9;c&#xE9;dent et retourne une nouvelle version de ce jeu de donn&#xE9;es dans lequel l&#x2019;attribut <code>grades</code> a &#xE9;t&#xE9; supprim&#xE9; et remplac&#xE9; par un attribut <code>n_grades</code> qui indique le nombre de notes re&#xE7;ues.</li>
<li>&#xC9;crire une fonction qui prend en entr&#xE9;e le jeu de donn&#xE9;es pr&#xE9;c&#xE9;dent et retourne une nouvelle version de ce jeu de donn&#xE9;es dans lequel l&#x2019;attribut <code>address</code> est supprim&#xE9; et remplac&#xE9; par deux nouveaux attributs <code>latitude</code> et <code>longitude</code> (l&#x2019;attribut <code>coordinates</code> est une liste contenant la longitude et la latitude, stock&#xE9;es dans cet ordre).</li>
<li>En utilisant les deux fonctions pr&#xE9;c&#xE9;dentes, exporter cette nouvelle version du jeu de donn&#xE9;es dans un fichier nomm&#xE9; <code>NYfood.csv</code>.</li>
</ol>
</body>
</html>
